#+title: Unit1
#+author: XyZ3r7

* WordCounter
 #+begin_src C
    #include <stdio.h>
    int main(){
        long nc = 0;

        while (getchar() != EOF){
            ++nc; //equals nc = nc + 1
        }
        printf("%1d\n", nc);

        return 0;
    }
 #+end_src

 #+RESULTS:
 : 1

* Word Counter
#+begin_src C
#include <stdio.h>

#define IN 1
#define OUT 0
//1.11: what kind of test sample will find potential errors: 1, Empty input/EOF only. 2, only sapce, tab and enter. 3, continuous spaces 4, single character with two spaces. (boundry values)
int main(){
    int c, nl, nw, nc, state;

    state = OUT;
    nl = nw = nc = 0;
    //State Machine, switching between word and out of word. When encounter a nonspace/enter/tab character but also has OUT state, it adds the word count. When met space\tab\enter, sets to out state and wait until it mets nonspace characters.
    while((c = getchar()) != EOF){
        ++nc;
        if(c == '\n'){
            ++nl;
        }
        if(c == ' ' || c == '\n' || c == '\t')
            state = OUT;
        else if (state == OUT){
            state = IN;
            ++nw;
        }
    }
}

#+end_src

* State Machine
 State: Object under current phase
 Event/Input: External reason that causes changes
 Transition: From one state jump to another state

* Switch & Case
 Creates Jump Table in memory(Continuous)
 When program reach switch(int), jump -> (instruction) address = Jump Table Base Address + c
 However, bc it's using c as offsets, when c is too large, compiler will not create jump table. Instead, it will creates: 1, BST. 2, Creates mutiple small Jump Table(use if to check approximate area first). 3, generate if-else to check when there's very little case. 4, Bitmap when mutiple close case value has same instructions.
